Repository: conestack/yafowil
Catalog: src/yafowil/i18n/locales/*/LC_MESSAGES/yafowil.po
Languages: de

# datatype_str
source: string
de: ASCII Zeichenkette

# datatype_unicode
source: unicode
de: Zeichenkette

# datatype_integer
source: integer
de: Ganzzahl

# datatype_float
source: floating point
de: Gleitkommazahl

# datatype_long
source: integer
de: Ganzzahl

# generic_datatype_message
source: Input conversion failed.
de: Eingabekonvertierung fehlgeschlagen

# standard_datatype_message
source: Input is not a valid ${datatype}.
de: Eingabe ist keine gültige ${datatype}.

# required_message
source: Mandatory field was empty
de: Feld erfordert eine Eingabe

# minlength_extraction_error
source: Input must have at least ${len} characters.
de: Eingabe muss mindestens ${len} Zeichen lang sein.

# ascii_extractor_error
source: Input contains illegal characters.
de: Eingabe enthält ungültige Zeichen

# weak_password_message
source: Password too weak
de: Passwort zu schwach

source: Yes
de: Ja

source: No
de: Nein

source: Unset
de: Ohne Wert

# file_replace_no_upload
source: Cannot replace file. No file uploaded.
de: Datei kann nicht ersetzt werden. Keine Datei hochgeladen

# file_invalid_mimetype
source: Mimetype of uploaded file not matches
de: Ungültiger Dateityp hochgeladen

source: No file
de: Keine Datei

source: Unknown
de: Unbekannt

source: Filename:
de: Dateiname:

source: Mimetype:
de: Dateityp:

source: Size:
de: Größe:

# file_keep
source: Keep Existing file
de: Behalte bestehende Datei

# file_replace
source: Replace existing file
de: Ersetze bestehende Datei

# file_delete
source: Delete existing file
de: Lösche bestehende Datei

# email_address_not_valid
source: Input not a valid email address.
de: Eingabe ist keine gültige E-Mail Adresse.

# web_address_not_valid
source: Input not a valid web address.
de: Eingabe ist keine gültige Webadresse.

# input_number_minimum_value
source: Value has to be at minimum ${min}.
de: Wert muss mindestens ${min} betragen.

# input_number_maximum_value
source: Value has to be at maximum ${max}.
de: Wert darf maximal ${max} betragen.

# input_number_step_and_minimum_value
source: Value ${val} has to be in stepping of ${step} based on a floor value of ${minimum}
de: Wert ${val} muss mindestens ${minimum} betragen und durch ${step} teilbar sein.

# input_number_step_value
source: Value ${val} has to be in stepping of ${step}
de: Wert ${val} muss durch ${step} teilbar sein.
